Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/tutorial.tmx
Source language: en
Languages: pl

source: the next-to-last scope contains the current module's global names
pl: zakres widoczności od-następnego-do-ostatniego zawiera nazwy najwyższego rzędu dla aktualnego modułu

source: the outermost scope (searched last) is the namespace containing built-in names
pl: najbardziej zewnętrzny zakres widoczności (przeszukiwany jako ostatni) jest przestrzenią nazw zawierającą nazwy wbudowane

source: If a name is declared global, then all references and assignments go directly to the middle scope containing the module's global names. To rebind variables found outside of the innermost scope, the :keyword:`nonlocal` statement can be used; if not declared nonlocal, those variable are read-only (an attempt to write to such a variable will simply create a *new* local variable in the innermost scope, leaving the identically named outer variable unchanged).
pl: Jeśli nazwa jest określona na najwyższym poziomie widoczności modułu, wtedy wszystkie odwołania i przypisania dopasowują się do środkowego zakresu widoczności zawierającego nazwy najwyższego poziomu określone dla modułu. Aby ponownie związać zmienne znajdujące się na zewnątrz najgłębszego zakresu, określenie :keyword:`nonlocal` może zostać użyte; jeśli nie określone jako nonlocal, zmienne te są zmiennymi tylko-do-odczytu (próba zapisu do takiej zmiennej po prostu utworzy *nową* zmienną wewnętrzną funkcji w najbardziej zagnieżdżonym zakresie widoczności, pozostawiając jednakowo nazwaną zewnętrzną zmienną bez zmian).

source: Usually, the local scope references the local names of the (textually) current function. Outside functions, the local scope references the same namespace as the global scope: the module's namespace. Class definitions place yet another namespace in the local scope.
pl: Zwykle, wewnętrzny zakres widoczności odnosi się do nazw wewnętrznych dla (tekstowego zakresu) atualnej funkcji. Na zewnątrz funkcji, wewnętrzny zakres widoczności odwołuje się do tej samej przestrzeni nazw co zakres widoczności na poziomie głównym: przestrzeń nazw nadrzędna dla modułu. Definicje klas umieszczają jeszcze inną przestrzeń nazw w lokalnym zakresie widoczności.

source: It is important to realize that scopes are determined textually: the global scope of a function defined in a module is that module's namespace, no matter from where or by what alias the function is called. On the other hand, the actual search for names is done dynamically, at run time --- however, the language definition is evolving towards static name resolution, at "compile" time, so don't rely on dynamic name resolution! (In fact, local variables are already determined statically.)
pl: Ważne jest aby rozumieć że zakresy widoczności ustala się tekstowo: najwyższym możliwym zakresem widoczności dla funkcji określonej w module jest przestrzeń nazw tego modułu, niezależnie skąd i pod jaką nazwą funkcja jest wywoływana. Z drugiej strony, faktyczne poszukiwanie nazw wykonywane jest dynamicznie w czasie wykonania --- jednakże, założenia języka rozwijają się w kierunku statycznego rozstrzygania nazw, w czasie "kompilacji", więc nie polegaj na dynamicznym rozstrzyganiu nazw! (W istocie, zmienne lokalne już teraz są ustalane statycznie).

source: A special quirk of Python is that -- if no :keyword:`global` statement is in effect -- assignments to names always go into the innermost scope. Assignments do not copy data --- they just bind names to objects. The same is true for deletions: the statement ``del x`` removes the binding of ``x`` from the namespace referenced by the local scope. In fact, all operations that introduce new names use the local scope: in particular, :keyword:`import` statements and function definitions bind the module or function name in the local scope.
pl: Specjalnym zachowaniem języka Python jest to, że -- jeśli żadne określenie :keyword:`global` nie pozostaje w mocy -- wtedy przypisania do nazw zawsze odwołują się do najbardziej zagłębionego zakresu widoczności. Przypisania nie kopiują danych --- wiążą tylko nazwy z obiektami. To samo zachodzi dla usunięć: wyrażenie ``del x`` usuwa wiązanie nazwy ``x`` z przestrzeni nazw, do której odnosi się lokalny zakres widoczności. Właściwie wszystkie operacje, które wprowadzają nowe nazwy używają lokalnego zakresu widoczności: w szczególności, instrukcje :keyword:`import` i określenia funkcji wiążą moduł lub nazwę funkcji w lokalnym zakresie widoczności.

source: The :keyword:`global` statement can be used to indicate that particular variables live in the global scope and should be rebound there; the :keyword:`nonlocal` statement indicates that particular variables live in an enclosing scope and should be rebound there.
pl: Określenie :keyword:`global` może być użyte do oznaczenia, że poszczególne zmienne znajdą się w głównym zakresie widoczności dla danego modułu i powinny być ponownie wiązane tam; określenie :keyword:`nonlocal` sygnalizuje, że określone zmienne znajdują się w otaczającym zakresie widoczności i tam powinny być ponownie wiązane.

source: Scopes and Namespaces Example
pl: Przykład zakresów widoczności i przestrzeni nazw

source: This is an example demonstrating how to reference the different scopes and namespaces, and how :keyword:`global` and :keyword:`nonlocal` affect variable binding::
pl: To jest przykład demonstrujący jak odwoływać się do różnych zakresów widoczności i przestrzeni nazw, i jak określenia :keyword:`global` i :keyword:`nonlocal` wpływają na wiązanie zmiennej::

source: def scope_test(): def do_local(): spam = "local spam" def do_nonlocal(): nonlocal spam spam = "nonlocal spam" def do_global(): global spam spam = "global spam" spam = "test spam" do_local() print("After local assignment:", spam) do_nonlocal() print("After nonlocal assignment:", spam) do_global() print("After global assignment:", spam) scope_test() print("In global scope:", spam)
pl: def sprawdzenie_widocznosci(): def wykonuj_miejscowo(): smiecie = "miejscowe śmiecie" def wykonuj_zamiejscowo(): nonlocal smiecie smiecie = "zamiejscowe śmiecie" def wykonuj_nadrzednie(): global smiecie smiecie = "nadrzędne śmiecie" smiecie = "próbne śmiecie" wykonuj_miejscowo() print("Po miejscowym przypisaniu:", smiecie) wykonuj_zamiejscowo() print("Po zamiejscowym przypisaniu:", smiecie) wykonuj_nadrzednie() print("Po nadrzędnym przypisaniu:", smiecie) sprawdzenie_widocznosci() print("W nadrzędnym zakresie widoczności:", smiecie)

source: The output of the example code is::
pl: Wynikiem przykładowego programu jest::

source: After local assignment: test spam After nonlocal assignment: nonlocal spam After global assignment: nonlocal spam In global scope: global spam
pl: Po miejscowym przypisaniu: próbne śmiecie Po zamiejscowym przypisaniu: zamiejscowe śmiecie Po nadrzędnym przypisaniu: zamiejscowe śmiecie W nadrzędnym zakresie widoczności: nadrzędne śmiecie

source: Note how the *local* assignment (which is default) didn't change *scope_test*\'s binding of *spam*. The :keyword:`nonlocal` assignment changed *scope_test*\'s binding of *spam*, and the :keyword:`global` assignment changed the module-level binding.
pl: Zauważ jednakże że "miejscowe" (z ang. - *local*) przypisanie (które jest podstawowe) nie zmieniło powiązania *śmieci* w *sprawdzeniu_widoczności*. Przypisanie zamiejscowe ( - z ang. - :keyword:`nonlocal`) zmienił powiąznie *śmieci* w *sprawdzeniu_widoczności*, i nadrzędne przypisanie ( - z ang. - :keyword:`global`) zmieniło powiązanie na poziomie nadrzędnym.

source: You can also see that there was no previous binding for *spam* before the :keyword:`global` assignment.
pl: Możesz także zauważyć, że nie było poprzedzającego powiązania *śmieci* przed przypisaniem *nadrzędnym* ( - z ang. - :keyword:`global`).

source: A First Look at Classes
pl: Pierwsze Spojrzenie na Uogólnienia

source: Classes introduce a little bit of new syntax, three new object types, and some new semantics.
pl: Uogólnienia wprowadzają troszkę nowej składni, trzy nowe rodzaje przedmiotów, i pewną nową terminologię.

source: Class Definition Syntax
pl: Składnia Ustanawiania Założeń Uogólnień

source: The simplest form of class definition looks like this::
pl: Najprostsza postać ustanawiania założeń uogólnienia wygląda następująco::

source: class ClassName: <statement-1> . . . <statement-N>
pl: class Nazwa_Uogólnienia: <polecenie-1> . . . <polecenie-N>

source: Class definitions, like function definitions (:keyword:`def` statements) must be executed before they have any effect. (You could conceivably place a class definition in a branch of an :keyword:`if` statement, or inside a function.)
pl: opisy uogólnień, podobnie do opisów zadań (rozpoczynane poleceniem :keyword:`def`) muszą być wykonane zanim będą mogły być użyte. (Jest możliwe umieszczenie opisu uogólnienia w rozgałęzieniu zawartym w poleceniu jeżeli - z ang. - :keyword:`if`, lub we wnętrzu zadania.)

source: In practice, the statements inside a class definition will usually be function definitions, but other statements are allowed, and sometimes useful --- we'll come back to this later. The function definitions inside a class normally have a peculiar form of argument list, dictated by the calling conventions for methods --- again, this is explained later.
pl: W praktyce, polecenia we wnętrzu określenia uogólnienia zazwyczaj są określeniami zadań, ale inne polecenia też są dozwolone, i czasami przydatne --- powrócimy do tej kwestii za chwilę. Określenie zadania we wnętrzu uogólnienia z zasady ma osobliwą postać spisu wytycznych, wyznaczoną przez obyczaje odnoszenia się do sposobów postępowania uogólnień --- i znów, zostanie to wyjaśnione w dalszej kolejności.

source: When a class definition is entered, a new namespace is created, and used as the local scope --- thus, all assignments to local variables go into this new namespace. In particular, function definitions bind the name of the new function here.
pl: Gdy wprowadzone zostaje określenie uogólnienia, nowa przestrzeń nazw jest tworzona, i używana jako miejscowy zakres widoczności --- stąd, wszystkie przypisania do miejscowych nazw odnoszą się do tej nowej przestrzeni nazw. W szczególności, określenia zadań wiążą tam nazwę nowego zadania.

source: When a class definition is left normally (via the end), a *class object* is created. This is basically a wrapper around the contents of the namespace created by the class definition; we'll learn more about class objects in the next section. The original local scope (the one in effect just before the class definition was entered) is reinstated, and the class object is bound here to the class name given in the class definition header (:class:`ClassName` in the example).
pl: Gdy wprowadzanie określenia zadania jest kończone zwyczajnie (przez przejście poza miejsca zakończenia), przedmiot przedstawiający porządek tego uogólnienia jest tworzony. Jest on w zasadzie opakowaniem wokół zawartości przestrzeni nazw utworzonej przy okazji wprowadzania określenia uogólnienia. Dowiemy się więcej o przedmiotach przedstawiających porządki uogólnień w następnej części poradnika. Pierwotny miejscowy zakres widoczności (który miał zastosowanie jeszcze zanim wprowadzono określenie uogólnienia) jest przywracany, i przedmiot przedstawiający porządek uogólnienia jest wiązany tamże do nazwy uogólnienia podanej na początku określenia uogólnienia (w podanym przykładzie ":uogólnienie:`Nazwa_Uogólnienia`" - z ang. - :class:`Nazwa_Uogólnienia`).

source: Class Objects
pl: Przedmioty przedstawiające porządek Uogólnienia

source: Class objects support two kinds of operations: attribute references and instantiation.
pl: Przedmioty przedstawiające porządek uogólnienia pozwalają na działania dwóch rodzajów: odnoszenie się do właściwości uogólnienia i tworzenie przykładowych przedmiotów.

source: *Attribute references* use the standard syntax used for all attribute references in Python: ``obj.name``. Valid attribute names are all the names that were in the class's namespace when the class object was created. So, if the class definition looked like this::
pl: *Odniesienia do własności* używają standardowej składni używanej dla wszystkich odniesień do własności w języku pytonowskim: ``przedmiot.nazwa``. Właściwe nazwy własności są to wszystkie nazwy, które były w przestrzeni nazw uogólnienia gdy przedmiot reprezentujący to uogólnienie został utworzony. Więc jeśli definicja uogólnienia wyglądała następująco::

source: class MyClass: """A simple example class""" i = 12345 def f(self): return 'hello world'
pl: class MojeUogolnienie: """Prosty przykład uogólnienia""" i = 12345 def f(self): return 'witaj świecie'

source: then ``MyClass.i`` and ``MyClass.f`` are valid attribute references, returning an integer and a function object, respectively. Class attributes can also be assigned to, so you can change the value of ``MyClass.i`` by assignment. :attr:`__doc__` is also a valid attribute, returning the docstring belonging to the class: ``"A simple example class"``.
pl: wtedy ``MojeUogolnienie.i`` i ``MojeUogolnienie.f`` są prawidłowymi odniesieniami do własności, zwracającymi liczbę całkowitą i przedmiot zadania, odpowiednio. Własności uogólnienia mogą także być przedmiotem przypisania więc można zmienić wartość ``MojeUogolnienie.i`` przez przypisanie. :attr:`__doc__` jest także prawidłowym atrybutem, zwracającym ciąg dokumentacji ( - z ang. - docstring ) należący do uogólnienia ``"Prosty przykład uogólnienia"``.

source: Class *instantiation* uses function notation. Just pretend that the class object is a parameterless function that returns a new instance of the class. For example (assuming the above class)::
pl: *Dawanie przykładu* uogólnienia używa notacji zadania. Udawajmy że przedmiot uogólnienia jest zadaniem bez parametrów które zwraca nowy przykład uogólnienia. Dla przykładu (przyjmując założenia powyższego uogólnienia)::

source: x = MyClass()
pl: x = MojeUogolnienie()

source: creates a new *instance* of the class and assigns this object to the local variable ``x``.
pl: tworzy nowy *przykład* uogólnienia i przypisuje ten przedmiot zmiennej lokalnej ``x``.

source: The instantiation operation ("calling" a class object) creates an empty object. Many classes like to create objects with instances customized to a specific initial state. Therefore a class may define a special method named :meth:`__init__`, like this::
pl: operacja dawanie przykładu ("wezwanie" przedmiotu uogólnienia) tworzy pusty przedmiot. Wiele uogólnień "lubi" tworzyć przedmioty jako przykłady dostosowane przez nadanie szczególnego stanu początkowego. Dlatego uogólnienie może definiować specjalne sposoby postępowania nazwane :meth:`__init__`, jak te::

source: When a class defines an :meth:`__init__` method, class instantiation automatically invokes :meth:`__init__` for the newly-created class instance. So in this example, a new, initialized instance can be obtained by::
pl: Gdy uogólnienie definiuje sposób postępowania :meth:`__init__`, dawanie przykładu danego uogólnienia automatycznie wzywa :meth:`__init__` dla nowo utworzonego przykładu uogólnienia. Więc w tym przykładzie nowy zainicjowany przykład można otrzymać przez::

source: Of course, the :meth:`__init__` method may have arguments for greater flexibility. In that case, arguments given to the class instantiation operator are passed on to :meth:`__init__`. For example, ::
pl: Oczywiście sposób postępowania :meth:`__init__` może mieć parametry dla większej elastyczności. W takim przypadku parametry dostarczone operatorowi dania przykładu uogólnienia są przekazane do :meth:`__init__`. Na przykład, ::

source: >>> class Complex: ... def __init__(self, realpart, imagpart): ... self.r = realpart ... self.i = imagpart ... >>> x = Complex(3.0, -4.5) >>> x.r, x.i (3.0, -4.5)
pl: >>> class Zespolone: ... def __init __(self,rzeczczesc,urojonaczesc): ... self.r = rzeczczesc ... self.i = urojonaczesc ... >>> x = Zespolone(3.0,-4.5) >>> x.r, x.i (3.0, -4.5)

source: Instance Objects
pl: Przedmioty Przykładów

source: Now what can we do with instance objects? The only operations understood by instance objects are attribute references. There are two kinds of valid attribute names, data attributes and methods.
pl: Co teraz możemy począć z przedmiotami przykładów? Jedynymi operacjami zrozumiałymi dla przedmiotów przykładów są odwołania do właściwości. Są dwa rodzaje prawidłowych nazw właściwości, właściwości danych i sposobów postępowania.

source: *data attributes* correspond to "instance variables" in Smalltalk, and to "data members" in C++. Data attributes need not be declared; like local variables, they spring into existence when they are first assigned to. For example, if ``x`` is the instance of :class:`MyClass` created above, the following piece of code will print the value ``16``, without leaving a trace::
pl: *właściwości danych* odpowiadają "zmiennym przykładowym" w Smalltalku i do "członków danych" w C++. Właściwości danych nie muszą być deklarowane; tak jak zmienne lokalne wyrastają do życia gdy pierwszy raz nastąpi przypisanie do nich wartości. Na przykład jeśli ``x`` jest przykładem :class:`MojegoUogolnienia` utworzonego powyżej, następujący kawałek kodu wypisze wartość ``16`` bez zostawiania śladu::
